BAS BMEKZU Project/src/Documents/ИНАГРО_УстановкаПоказателейВТС/ИНАГРО_УстановкаПоказателейВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_УстановкаПоказателейВТС</name>
  <registerRecords>InformationRegister.ИНАГРО_ПоказанияСпидометраИБака</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказанияСпидометра</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ПоказанияСпидометраИБака/ИНАГРО_ПоказанияСпидометраИБака.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_ПоказанияСпидометраИБака</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПоказанияСпидометра</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказанияБака</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Documents/ИНАГРО_УстановкаПоказателейВТС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);

	ЗапросПоТС = Новый Запрос();
	
	ЗапросПоТС.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИНАГРО_ПоказанияСпидометраИБакаСрезПоследних.ПоказанияБака
		|ИЗ
		|	РегистрСведений.ИНАГРО_ПоказанияСпидометраИБака.СрезПоследних(&ДатаСреза, ОсновноеСредство = &ОсновноеСредство) КАК ИНАГРО_ПоказанияСпидометраИБакаСрезПоследних";
		
	ЗапросПоТС.УстановитьПараметр("ДатаСреза",        Дата);
	ЗапросПоТС.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	
	Показания = ЗапросПоТС.Выполнить().Выбрать();
	
	Пока Показания.Следующий() Цикл
		ПоказанияБака = Показания.ПоказанияБака;
	КонецЦикла;	
	
	Движение = Движения.ИНАГРО_ПоказанияСпидометраИБака.Добавить();
	Движение.Период              = Дата;
	Движение.ОсновноеСредство    = ОсновноеСредство;
	Движение.ПоказанияСпидометра = ПоказанияСпидометра;
	Движение.ПоказанияБака       = ПоказанияБака;	
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект); 

КонецПроцедуры   

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
